In this we are going to learn few convinient methods to deal with the missing data

#pandas will automaticaly will fill the missing value

In [16]:
import numpy as np
import pandas as pd

In [17]:
#we can also create a dataframe through dictionary

In [18]:
d = {"A":[1,2,np.nan],"B":[5,np.nan,np.nan],"C":[1,2,3] }  #here the keys will act as rows and we will pass the list to each key
# key will be rows and the value will be colomn element of each key

In [19]:
df = pd.DataFrame(d)

In [20]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

dropna is one of the methods to find the missing value

In [21]:
#dropna will drop the row if it has one or more missing values

In [22]:
df.dropna() #here axis is 0, so the operation will be amomg the rows

     A    B  C
0  1.0  5.0  1

In [23]:
#if we want to drop the value aong column , put axis= 1

In [24]:
df.dropna(axis= 1)

   C
0  1
1  2
2  3

In [27]:
df.dropna(thresh= 2) #takes the value in which atleast two values are known

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [28]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [30]:
#if we want fill in the  df.fillna
df.fillna(value= "fill value") # it will fill as fill value

            A           B  C
0           1           5  1
1           2  fill value  2
2  fill value  fill value  3

In [31]:
#if we want to fill 2 of column A as mean of the row
df["A"]

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [33]:
df["A"].fillna(value = df["A"].mean()) # take the mean of the column a

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

#suppose if i want to make the b[1] as the average both columns

In [37]:
df.iloc[1]

A    2.0
B    NaN
C    2.0
Name: 1, dtype: float64

In [38]:
df.iloc[1].fillna(value = df.iloc[1].mean())

A    2.0
B    2.0
C    2.0
Name: 1, dtype: float64